kinx-project/mk66f-fw/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTA14 (number 66), U13[15]/RMII0_CRS_DV
  @{ */
#define BOARD_INITPINS_DEBUG_UART_TX_PERIPHERAL UART0             /*!<@brief Device name: UART0 */
#define BOARD_INITPINS_DEBUG_UART_TX_SIGNAL TX                    /*!<@brief UART0 signal: TX */
#define BOARD_INITPINS_DEBUG_UART_TX_PORT PORTA                   /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_DEBUG_UART_TX_PIN 14U                      /*!<@brief PORTA pin index: 14 */
#define BOARD_INITPINS_DEBUG_UART_TX_PIN_NAME UART0_TX            /*!<@brief Pin name */
#define BOARD_INITPINS_DEBUG_UART_TX_LABEL "U13[15]/RMII0_CRS_DV" /*!<@brief Label */
#define BOARD_INITPINS_DEBUG_UART_TX_NAME "DEBUG_UART_TX"         /*!<@brief Identifier name */
                                                                  /* @} */

/*! @name PORTA15 (number 67), U13[19]/RMII0_TXEN
  @{ */
#define BOARD_INITPINS_DEBUG_UART_RX_PERIPHERAL UART0           /*!<@brief Device name: UART0 */
#define BOARD_INITPINS_DEBUG_UART_RX_SIGNAL RX                  /*!<@brief UART0 signal: RX */
#define BOARD_INITPINS_DEBUG_UART_RX_PORT PORTA                 /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_DEBUG_UART_RX_PIN 15U                    /*!<@brief PORTA pin index: 15 */
#define BOARD_INITPINS_DEBUG_UART_RX_PIN_NAME UART0_RX          /*!<@brief Pin name */
#define BOARD_INITPINS_DEBUG_UART_RX_LABEL "U13[19]/RMII0_TXEN" /*!<@brief Label */
#define BOARD_INITPINS_DEBUG_UART_RX_NAME "DEBUG_UART_RX"       /*!<@brief Identifier name */
                                                                /* @} */

/*! @name PORTC0 (number 103), LED_SCROLL_LOCK
  @{ */
#define BOARD_INITPINS_LED_SCROLL_LOCK_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_LED_SCROLL_LOCK_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_LED_SCROLL_LOCK_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_LED_SCROLL_LOCK_GPIO_PIN 0U                        /*!<@brief PORTC pin index: 0 */
#define BOARD_INITPINS_LED_SCROLL_LOCK_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_LED_SCROLL_LOCK_PIN 0U                             /*!<@brief PORTC pin index: 0 */
#define BOARD_INITPINS_LED_SCROLL_LOCK_CHANNEL 0                          /*!<@brief GPIOC GPIO channel: 0 */
#define BOARD_INITPINS_LED_SCROLL_LOCK_PIN_NAME PTC0                      /*!<@brief Pin name */
#define BOARD_INITPINS_LED_SCROLL_LOCK_LABEL "LED_SCROLL_LOCK"            /*!<@brief Label */
#define BOARD_INITPINS_LED_SCROLL_LOCK_NAME "LED_SCROLL_LOCK"             /*!<@brief Identifier name */
#define BOARD_INITPINS_LED_SCROLL_LOCK_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                          /* @} */

/*! @name PORTC1 (number 104), LED_NUM_LOCK
  @{ */
#define BOARD_INITPINS_LED_NUM_LOCK_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_LED_NUM_LOCK_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_LED_NUM_LOCK_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_LED_NUM_LOCK_GPIO_PIN 1U                        /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_LED_NUM_LOCK_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_LED_NUM_LOCK_PIN 1U                             /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_LED_NUM_LOCK_CHANNEL 1                          /*!<@brief GPIOC GPIO channel: 1 */
#define BOARD_INITPINS_LED_NUM_LOCK_PIN_NAME PTC1                      /*!<@brief Pin name */
#define BOARD_INITPINS_LED_NUM_LOCK_LABEL "LED_NUM_LOCK"               /*!<@brief Label */
#define BOARD_INITPINS_LED_NUM_LOCK_NAME "LED_NUM_LOCK"                /*!<@brief Identifier name */
#define BOARD_INITPINS_LED_NUM_LOCK_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                       /* @} */

/*! @name PORTC2 (number 105), LED_CAPS_LOCK
  @{ */
#define BOARD_INITPINS_LED_CAPS_LOCK_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_LED_CAPS_LOCK_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_LED_CAPS_LOCK_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_LED_CAPS_LOCK_GPIO_PIN 2U                        /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_LED_CAPS_LOCK_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_LED_CAPS_LOCK_PIN 2U                             /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_LED_CAPS_LOCK_CHANNEL 2                          /*!<@brief GPIOC GPIO channel: 2 */
#define BOARD_INITPINS_LED_CAPS_LOCK_PIN_NAME PTC2                      /*!<@brief Pin name */
#define BOARD_INITPINS_LED_CAPS_LOCK_LABEL "LED_CAPS_LOCK"              /*!<@brief Label */
#define BOARD_INITPINS_LED_CAPS_LOCK_NAME "LED_CAPS_LOCK"               /*!<@brief Identifier name */
#define BOARD_INITPINS_LED_CAPS_LOCK_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                        /* @} */

/*! @name PORTB23 (number 102), LED_NUMPAD
  @{ */
#define BOARD_INITPINS_LED_NUMPAD_PERIPHERAL GPIOB                   /*!<@brief Device name: GPIOB */
#define BOARD_INITPINS_LED_NUMPAD_SIGNAL GPIO                        /*!<@brief GPIOB signal: GPIO */
#define BOARD_INITPINS_LED_NUMPAD_GPIO GPIOB                         /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_LED_NUMPAD_GPIO_PIN 23U                       /*!<@brief PORTB pin index: 23 */
#define BOARD_INITPINS_LED_NUMPAD_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_LED_NUMPAD_PIN 23U                            /*!<@brief PORTB pin index: 23 */
#define BOARD_INITPINS_LED_NUMPAD_CHANNEL 23                         /*!<@brief GPIOB GPIO channel: 23 */
#define BOARD_INITPINS_LED_NUMPAD_PIN_NAME PTB23                     /*!<@brief Pin name */
#define BOARD_INITPINS_LED_NUMPAD_LABEL "LED_NUMPAD"                 /*!<@brief Label */
#define BOARD_INITPINS_LED_NUMPAD_NAME "LED_NUMPAD"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_LED_NUMPAD_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                     /* @} */

