kinx-project/mk66f-fw/board/pin_mux.h
/*! @name PORTD7 (number 136), J6[7]/SPI1_SIN/MISO
  @{ */
#define BOARD_INITPINS_ROW_ESC_PERIPHERAL GPIOD                   /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_ROW_ESC_SIGNAL GPIO                        /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_ROW_ESC_GPIO GPIOD                         /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_ROW_ESC_GPIO_PIN 7U                        /*!<@brief PORTD pin index: 7 */
#define BOARD_INITPINS_ROW_ESC_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_ROW_ESC_PIN 7U                             /*!<@brief PORTD pin index: 7 */
#define BOARD_INITPINS_ROW_ESC_CHANNEL 7                          /*!<@brief GPIOD GPIO channel: 7 */
#define BOARD_INITPINS_ROW_ESC_PIN_NAME PTD7                      /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_ESC_LABEL "J6[7]/SPI1_SIN/MISO"        /*!<@brief Label */
#define BOARD_INITPINS_ROW_ESC_NAME "ROW_ESC"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_ESC_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTD8 (number 137), U8[4]/U19[11]/I2C0_SCL
  @{ */
#define BOARD_INITPINS_ROW_F1_PERIPHERAL GPIOD                   /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_ROW_F1_SIGNAL GPIO                        /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_ROW_F1_GPIO GPIOD                         /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_ROW_F1_GPIO_PIN 8U                        /*!<@brief PORTD pin index: 8 */
#define BOARD_INITPINS_ROW_F1_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_ROW_F1_PIN 8U                             /*!<@brief PORTD pin index: 8 */
#define BOARD_INITPINS_ROW_F1_CHANNEL 8                          /*!<@brief GPIOD GPIO channel: 8 */
#define BOARD_INITPINS_ROW_F1_PIN_NAME PTD8                      /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_F1_LABEL "U8[4]/U19[11]/I2C0_SCL"     /*!<@brief Label */
#define BOARD_INITPINS_ROW_F1_NAME "ROW_F1"                      /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_F1_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PORTD9 (number 138), U8[6]/U19[12]/I2C0_SDA
  @{ */
#define BOARD_INITPINS_ROW_F2_PERIPHERAL GPIOD                   /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_ROW_F2_SIGNAL GPIO                        /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_ROW_F2_GPIO GPIOD                         /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_ROW_F2_GPIO_PIN 9U                        /*!<@brief PORTD pin index: 9 */
#define BOARD_INITPINS_ROW_F2_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_ROW_F2_PIN 9U                             /*!<@brief PORTD pin index: 9 */
#define BOARD_INITPINS_ROW_F2_CHANNEL 9                          /*!<@brief GPIOD GPIO channel: 9 */
#define BOARD_INITPINS_ROW_F2_PIN_NAME PTD9                      /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_F2_LABEL "U8[6]/U19[12]/I2C0_SDA"     /*!<@brief Label */
#define BOARD_INITPINS_ROW_F2_NAME "ROW_F2"                      /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_F2_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PORTC9 (number 114), LEDRGB_RED
  @{ */
#define BOARD_INITPINS_ROW_EQL_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_ROW_EQL_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_ROW_EQL_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_ROW_EQL_GPIO_PIN 9U                        /*!<@brief PORTC pin index: 9 */
#define BOARD_INITPINS_ROW_EQL_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_ROW_EQL_PIN 9U                             /*!<@brief PORTC pin index: 9 */
#define BOARD_INITPINS_ROW_EQL_CHANNEL 9                          /*!<@brief GPIOC GPIO channel: 9 */
#define BOARD_INITPINS_ROW_EQL_PIN_NAME PTC9                      /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_EQL_LABEL "LEDRGB_RED"                 /*!<@brief Label */
#define BOARD_INITPINS_ROW_EQL_NAME "ROW_EQL"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_EQL_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTC8 (number 113), J1[8]/FTM3_CH4/ADC1_SE4b
  @{ */
#define BOARD_INITPINS_ROW_1_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_ROW_1_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_ROW_1_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_ROW_1_GPIO_PIN 8U                        /*!<@brief PORTC pin index: 8 */
#define BOARD_INITPINS_ROW_1_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_ROW_1_PIN 8U                             /*!<@brief PORTC pin index: 8 */
#define BOARD_INITPINS_ROW_1_CHANNEL 8                          /*!<@brief GPIOC GPIO channel: 8 */
#define BOARD_INITPINS_ROW_1_PIN_NAME PTC8                      /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_1_LABEL "J1[8]/FTM3_CH4/ADC1_SE4b"   /*!<@brief Label */
#define BOARD_INITPINS_ROW_1_NAME "ROW_1"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_1_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                /* @} */

/*! @name PORTC7 (number 112), J1[11]/USB0_SOF_OUT/I2S0_RX_FS/FB_AD8
  @{ */
#define BOARD_INITPINS_ROW_2_PERIPHERAL GPIOC                              /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_ROW_2_SIGNAL GPIO                                   /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_ROW_2_GPIO GPIOC                                    /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_ROW_2_GPIO_PIN 7U                                   /*!<@brief PORTC pin index: 7 */
#define BOARD_INITPINS_ROW_2_PORT PORTC                                    /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_ROW_2_PIN 7U                                        /*!<@brief PORTC pin index: 7 */
#define BOARD_INITPINS_ROW_2_CHANNEL 7                                     /*!<@brief GPIOC GPIO channel: 7 */
#define BOARD_INITPINS_ROW_2_PIN_NAME PTC7                                 /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_2_LABEL "J1[11]/USB0_SOF_OUT/I2S0_RX_FS/FB_AD8" /*!<@brief Label */
#define BOARD_INITPINS_ROW_2_NAME "ROW_2"                                  /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_2_DIRECTION kPIN_MUX_DirectionOutput            /*!<@brief Direction */
                                                                           /* @} */

/*! @name PORTC6 (number 111), J1[9]/LLWU_P10/FB_AD9/I2S0_MCLK
  @{ */
#define BOARD_INITPINS_ROW_3_PERIPHERAL GPIOC                        /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_ROW_3_SIGNAL GPIO                             /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_ROW_3_GPIO GPIOC                              /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_ROW_3_GPIO_PIN 6U                             /*!<@brief PORTC pin index: 6 */
#define BOARD_INITPINS_ROW_3_PORT PORTC                              /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_ROW_3_PIN 6U                                  /*!<@brief PORTC pin index: 6 */
#define BOARD_INITPINS_ROW_3_CHANNEL 6                               /*!<@brief GPIOC GPIO channel: 6 */
#define BOARD_INITPINS_ROW_3_PIN_NAME PTC6                           /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_3_LABEL "J1[9]/LLWU_P10/FB_AD9/I2S0_MCLK" /*!<@brief Label */
#define BOARD_INITPINS_ROW_3_NAME "ROW_3"                            /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_3_DIRECTION kPIN_MUX_DirectionOutput      /*!<@brief Direction */
                                                                     /* @} */

/*! @name PORTC5 (number 110), J1[12]/I2S0_RXD0/FB_AD10/FTM0_CH2
  @{ */
#define BOARD_INITPINS_ROW_4_PERIPHERAL GPIOC                          /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_ROW_4_SIGNAL GPIO                               /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_ROW_4_GPIO GPIOC                                /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_ROW_4_GPIO_PIN 5U                               /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_ROW_4_PORT PORTC                                /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_ROW_4_PIN 5U                                    /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_ROW_4_CHANNEL 5                                 /*!<@brief GPIOC GPIO channel: 5 */
#define BOARD_INITPINS_ROW_4_PIN_NAME PTC5                             /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_4_LABEL "J1[12]/I2S0_RXD0/FB_AD10/FTM0_CH2" /*!<@brief Label */
#define BOARD_INITPINS_ROW_4_NAME "ROW_4"                              /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_4_DIRECTION kPIN_MUX_DirectionOutput        /*!<@brief Direction */
                                                                       /* @} */

/*! @name PORTC4 (number 109), J1[4]/UART1_TX/FTM0_CH3/FB_AD11
  @{ */
#define BOARD_INITPINS_ROW_5_PERIPHERAL GPIOC                        /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_ROW_5_SIGNAL GPIO                             /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_ROW_5_GPIO GPIOC                              /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_ROW_5_GPIO_PIN 4U                             /*!<@brief PORTC pin index: 4 */
#define BOARD_INITPINS_ROW_5_PORT PORTC                              /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_ROW_5_PIN 4U                                  /*!<@brief PORTC pin index: 4 */
#define BOARD_INITPINS_ROW_5_CHANNEL 4                               /*!<@brief GPIOC GPIO channel: 4 */
#define BOARD_INITPINS_ROW_5_PIN_NAME PTC4                           /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_5_LABEL "J1[4]/UART1_TX/FTM0_CH3/FB_AD11" /*!<@brief Label */
#define BOARD_INITPINS_ROW_5_NAME "ROW_5"                            /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_5_DIRECTION kPIN_MUX_DirectionOutput      /*!<@brief Direction */
                                                                     /* @} */

