kinx-project/mk66f-fw/board/pin_mux.h
/*! @name PORTA29 (number 80), U19[3]/FXAS21002_INT1
  @{ */
#define BOARD_INITPINS_ROW_6_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_ROW_6_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_ROW_6_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_ROW_6_GPIO_PIN 29U                       /*!<@brief PORTA pin index: 29 */
#define BOARD_INITPINS_ROW_6_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_ROW_6_PIN 29U                            /*!<@brief PORTA pin index: 29 */
#define BOARD_INITPINS_ROW_6_CHANNEL 29                         /*!<@brief GPIOA GPIO channel: 29 */
#define BOARD_INITPINS_ROW_6_PIN_NAME PTA29                     /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_6_LABEL "U19[3]/FXAS21002_INT1"      /*!<@brief Label */
#define BOARD_INITPINS_ROW_6_NAME "ROW_6"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_6_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                /* @} */

/*! @name PORTA28 (number 79), U19[2]/FXAS21002_INT2
  @{ */
#define BOARD_INITPINS_ROW_8_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_ROW_8_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_ROW_8_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_ROW_8_GPIO_PIN 28U                       /*!<@brief PORTA pin index: 28 */
#define BOARD_INITPINS_ROW_8_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_ROW_8_PIN 28U                            /*!<@brief PORTA pin index: 28 */
#define BOARD_INITPINS_ROW_8_CHANNEL 28                         /*!<@brief GPIOA GPIO channel: 28 */
#define BOARD_INITPINS_ROW_8_PIN_NAME PTA28                     /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_8_LABEL "U19[2]/FXAS21002_INT2"      /*!<@brief Label */
#define BOARD_INITPINS_ROW_8_NAME "ROW_8"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_8_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                /* @} */

/*! @name PORTA27 (number 78), J3[1]/FB_A26
  @{ */
#define BOARD_INITPINS_ROW_7_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_ROW_7_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_ROW_7_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_ROW_7_GPIO_PIN 27U                       /*!<@brief PORTA pin index: 27 */
#define BOARD_INITPINS_ROW_7_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_ROW_7_PIN 27U                            /*!<@brief PORTA pin index: 27 */
#define BOARD_INITPINS_ROW_7_CHANNEL 27                         /*!<@brief GPIOA GPIO channel: 27 */
#define BOARD_INITPINS_ROW_7_PIN_NAME PTA27                     /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_7_LABEL "J3[1]/FB_A26"               /*!<@brief Label */
#define BOARD_INITPINS_ROW_7_NAME "ROW_7"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_7_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                /* @} */

/*! @name PORTA26 (number 77), J3[3]/FB_A27
  @{ */
#define BOARD_INITPINS_ROW_MIN_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_ROW_MIN_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_ROW_MIN_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_ROW_MIN_GPIO_PIN 26U                       /*!<@brief PORTA pin index: 26 */
#define BOARD_INITPINS_ROW_MIN_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_ROW_MIN_PIN 26U                            /*!<@brief PORTA pin index: 26 */
#define BOARD_INITPINS_ROW_MIN_CHANNEL 26                         /*!<@brief GPIOA GPIO channel: 26 */
#define BOARD_INITPINS_ROW_MIN_PIN_NAME PTA26                     /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_MIN_LABEL "J3[3]/FB_A27"               /*!<@brief Label */
#define BOARD_INITPINS_ROW_MIN_NAME "ROW_MIN"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_MIN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTA25 (number 76), J1[16]/CMP3_IN5
  @{ */
#define BOARD_INITPINS_ROW_9_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_ROW_9_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_ROW_9_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_ROW_9_GPIO_PIN 25U                       /*!<@brief PORTA pin index: 25 */
#define BOARD_INITPINS_ROW_9_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_ROW_9_PIN 25U                            /*!<@brief PORTA pin index: 25 */
#define BOARD_INITPINS_ROW_9_CHANNEL 25                         /*!<@brief GPIOA GPIO channel: 25 */
#define BOARD_INITPINS_ROW_9_PIN_NAME PTA25                     /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_9_LABEL "J1[16]/CMP3_IN5"            /*!<@brief Label */
#define BOARD_INITPINS_ROW_9_NAME "ROW_9"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_9_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                /* @} */

/*! @name PORTA24 (number 75), NC
  @{ */
#define BOARD_INITPINS_ROW_0_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_INITPINS_ROW_0_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITPINS_ROW_0_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_ROW_0_GPIO_PIN 24U                       /*!<@brief PORTA pin index: 24 */
#define BOARD_INITPINS_ROW_0_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_ROW_0_PIN 24U                            /*!<@brief PORTA pin index: 24 */
#define BOARD_INITPINS_ROW_0_CHANNEL 24                         /*!<@brief GPIOA GPIO channel: 24 */
#define BOARD_INITPINS_ROW_0_PIN_NAME PTA24                     /*!<@brief Pin name */
#define BOARD_INITPINS_ROW_0_LABEL "NC"                         /*!<@brief Label */
#define BOARD_INITPINS_ROW_0_NAME "ROW_0"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_ROW_0_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                /* @} */

