kinx-project/mk66f-fw/board/pin_mux.h
/*! @name PORTD0 (number 127), J2[6]/SPI0_PCS0/FTM3_CH0
  @{ */
#define BOARD_INITPINS_COL0_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_COL0_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_COL0_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_COL0_GPIO_PIN 0U                       /*!<@brief PORTD pin index: 0 */
#define BOARD_INITPINS_COL0_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_COL0_PIN 0U                            /*!<@brief PORTD pin index: 0 */
#define BOARD_INITPINS_COL0_CHANNEL 0                         /*!<@brief GPIOD GPIO channel: 0 */
#define BOARD_INITPINS_COL0_PIN_NAME PTD0                     /*!<@brief Pin name */
#define BOARD_INITPINS_COL0_LABEL "J2[6]/SPI0_PCS0/FTM3_CH0"  /*!<@brief Label */
#define BOARD_INITPINS_COL0_NAME "COL0"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_COL0_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD1 (number 128), J2[12]/SPI0_SCK/FB_CS0_B
  @{ */
#define BOARD_INITPINS_COL1_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_COL1_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_COL1_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_COL1_GPIO_PIN 1U                       /*!<@brief PORTD pin index: 1 */
#define BOARD_INITPINS_COL1_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_COL1_PIN 1U                            /*!<@brief PORTD pin index: 1 */
#define BOARD_INITPINS_COL1_CHANNEL 1                         /*!<@brief GPIOD GPIO channel: 1 */
#define BOARD_INITPINS_COL1_PIN_NAME PTD1                     /*!<@brief Pin name */
#define BOARD_INITPINS_COL1_LABEL "J2[12]/SPI0_SCK/FB_CS0_B"  /*!<@brief Label */
#define BOARD_INITPINS_COL1_NAME "COL1"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_COL1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD2 (number 129), J2[8]/SPI0_SOUT/FB_AD4
  @{ */
#define BOARD_INITPINS_COL2_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_COL2_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_COL2_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_COL2_GPIO_PIN 2U                       /*!<@brief PORTD pin index: 2 */
#define BOARD_INITPINS_COL2_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_COL2_PIN 2U                            /*!<@brief PORTD pin index: 2 */
#define BOARD_INITPINS_COL2_CHANNEL 2                         /*!<@brief GPIOD GPIO channel: 2 */
#define BOARD_INITPINS_COL2_PIN_NAME PTD2                     /*!<@brief Pin name */
#define BOARD_INITPINS_COL2_LABEL "J2[8]/SPI0_SOUT/FB_AD4"    /*!<@brief Label */
#define BOARD_INITPINS_COL2_NAME "COL2"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_COL2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD3 (number 130), J2[10]/SPI0_SIN/FB_AD3
  @{ */
#define BOARD_INITPINS_COL3_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_COL3_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_COL3_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_COL3_GPIO_PIN 3U                       /*!<@brief PORTD pin index: 3 */
#define BOARD_INITPINS_COL3_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_COL3_PIN 3U                            /*!<@brief PORTD pin index: 3 */
#define BOARD_INITPINS_COL3_CHANNEL 3                         /*!<@brief GPIOD GPIO channel: 3 */
#define BOARD_INITPINS_COL3_PIN_NAME PTD3                     /*!<@brief Pin name */
#define BOARD_INITPINS_COL3_LABEL "J2[10]/SPI0_SIN/FB_AD3"    /*!<@brief Label */
#define BOARD_INITPINS_COL3_NAME "COL3"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_COL3_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD4 (number 131), J6[4]/SPI1_PCS0/CS
  @{ */
#define BOARD_INITPINS_COL4_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_COL4_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_COL4_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_COL4_GPIO_PIN 4U                       /*!<@brief PORTD pin index: 4 */
#define BOARD_INITPINS_COL4_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_COL4_PIN 4U                            /*!<@brief PORTD pin index: 4 */
#define BOARD_INITPINS_COL4_CHANNEL 4                         /*!<@brief GPIOD GPIO channel: 4 */
#define BOARD_INITPINS_COL4_PIN_NAME PTD4                     /*!<@brief Pin name */
#define BOARD_INITPINS_COL4_LABEL "J6[4]/SPI1_PCS0/CS"        /*!<@brief Label */
#define BOARD_INITPINS_COL4_NAME "COL4"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_COL4_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PORTD5 (number 132), J6[7]/SPI1_SCK/SCK
  @{ */
#define BOARD_INITPINS_COL5_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_COL5_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_COL5_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_COL5_GPIO_PIN 5U                       /*!<@brief PORTD pin index: 5 */
#define BOARD_INITPINS_COL5_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_COL5_PIN 5U                            /*!<@brief PORTD pin index: 5 */
#define BOARD_INITPINS_COL5_CHANNEL 5                         /*!<@brief GPIOD GPIO channel: 5 */
#define BOARD_INITPINS_COL5_PIN_NAME PTD5                     /*!<@brief Pin name */
#define BOARD_INITPINS_COL5_LABEL "J6[7]/SPI1_SCK/SCK"        /*!<@brief Label */
#define BOARD_INITPINS_COL5_NAME "COL5"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_COL5_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

