kinx-project/mk66f-fw/board/pin_mux.h
/*! @name PORTD6 (number 133), J6[6]/SPI1_SOUT/MOSI
  @{ */
#define BOARD_INITPINS_COL6_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_INITPINS_COL6_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_INITPINS_COL6_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_COL6_GPIO_PIN 6U                       /*!<@brief PORTD pin index: 6 */
#define BOARD_INITPINS_COL6_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_COL6_PIN 6U                            /*!<@brief PORTD pin index: 6 */
#define BOARD_INITPINS_COL6_CHANNEL 6                         /*!<@brief GPIOD GPIO channel: 6 */
#define BOARD_INITPINS_COL6_PIN_NAME PTD6                     /*!<@brief Pin name */
#define BOARD_INITPINS_COL6_LABEL "J6[6]/SPI1_SOUT/MOSI"      /*!<@brief Label */
#define BOARD_INITPINS_COL6_NAME "COL6"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_COL6_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
